{
    "version": "https://jsonfeed.org/version/1",
    "title": "Projecttopia",
    "description": "",
    "home_page_url": "https://harmonymedia.github.io/projecttopia",
    "feed_url": "https://harmonymedia.github.io/projecttopia/feed.json",
    "user_comment": "",
    "author": {
        "name": "Harmony"
    },
    "items": [
        {
            "id": "https://harmonymedia.github.io/projecttopia/marvel-comics-first-half-of-1998-part-2.html",
            "url": "https://harmonymedia.github.io/projecttopia/marvel-comics-first-half-of-1998-part-2.html",
            "title": "Marvel Comics: First Half of 1998, Part 2",
            "summary": "Excalibur #118-123 Some of my favorite characters ended up in Excalibur, including Kitty Pryde, Nightcrawler, and Rahne Sinclair. They're mixed in with some characters that I find to be extremely bland, like Pete Wisdom and Brian Braddock. Sorta along the same lines, Excalibur as a&hellip;",
            "content_html": "<p class=\"align-center\"><strong>Excalibur #118-123</strong></p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://harmonymedia.github.io/projecttopia/media/posts/5/Excalibur-118-123.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://harmonymedia.github.io/projecttopia/media/posts/5/responsive/Excalibur-118-123-xs.png 300w ,https://harmonymedia.github.io/projecttopia/media/posts/5/responsive/Excalibur-118-123-sm.png 480w ,https://harmonymedia.github.io/projecttopia/media/posts/5/responsive/Excalibur-118-123-md.png 768w ,https://harmonymedia.github.io/projecttopia/media/posts/5/responsive/Excalibur-118-123-lg.png 1024w ,https://harmonymedia.github.io/projecttopia/media/posts/5/responsive/Excalibur-118-123-xl.png 1360w ,https://harmonymedia.github.io/projecttopia/media/posts/5/responsive/Excalibur-118-123-2xl.png 1600w\"  alt=\"\" width=\"3598\" height=\"930\"></figure>\n<p>Some of my favorite characters ended up in Excalibur, including Kitty Pryde, Nightcrawler, and Rahne Sinclair. They're mixed in with some characters that I find to be extremely bland, like Pete Wisdom and Brian Braddock. Sorta along the same lines, Excalibur as a title is a bit of a mixed bag, but I ultimately have quite a lot of affection for it.<br><br>Excalibur is a spin-off X-book that's mostly unaffected by the X-Men crossover events by virtue of it taking place in Great Britain. As a result, it's almost totally based in old-school superhero soap opera drama; there's a lot of focus on who's dating who. There's some shitty boys in this series - what Kitty and Rahne see in Pete and Deadlock is totally beyond me - but I like a lot of the girl characters, and I like the unabashed fun of the action setpieces, from a malfunctioning pirate simulation to a series of living nightmares. This shit is my kryptonite.</p>\n<p> </p>\n<p class=\"align-center\"><strong>Fantastic Four vol 3 #1-8, Annual</strong> <strong>1998</strong></p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://harmonymedia.github.io/projecttopia/media/posts/5/Fantastic-Four-v3-1-8.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://harmonymedia.github.io/projecttopia/media/posts/5/responsive/Fantastic-Four-v3-1-8-xs.png 300w ,https://harmonymedia.github.io/projecttopia/media/posts/5/responsive/Fantastic-Four-v3-1-8-sm.png 480w ,https://harmonymedia.github.io/projecttopia/media/posts/5/responsive/Fantastic-Four-v3-1-8-md.png 768w ,https://harmonymedia.github.io/projecttopia/media/posts/5/responsive/Fantastic-Four-v3-1-8-lg.png 1024w ,https://harmonymedia.github.io/projecttopia/media/posts/5/responsive/Fantastic-Four-v3-1-8-xl.png 1360w ,https://harmonymedia.github.io/projecttopia/media/posts/5/responsive/Fantastic-Four-v3-1-8-2xl.png 1600w\"  alt=\"\" width=\"3128\" height=\"2428\"></figure>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://harmonymedia.github.io/projecttopia/media/posts/5/Fantastic-Four-v3-Annual-1998.jpg\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://harmonymedia.github.io/projecttopia/media/posts/5/responsive/Fantastic-Four-v3-Annual-1998-xs.jpg 300w ,https://harmonymedia.github.io/projecttopia/media/posts/5/responsive/Fantastic-Four-v3-Annual-1998-sm.jpg 480w ,https://harmonymedia.github.io/projecttopia/media/posts/5/responsive/Fantastic-Four-v3-Annual-1998-md.jpg 768w ,https://harmonymedia.github.io/projecttopia/media/posts/5/responsive/Fantastic-Four-v3-Annual-1998-lg.jpg 1024w ,https://harmonymedia.github.io/projecttopia/media/posts/5/responsive/Fantastic-Four-v3-Annual-1998-xl.jpg 1360w ,https://harmonymedia.github.io/projecttopia/media/posts/5/responsive/Fantastic-Four-v3-Annual-1998-2xl.jpg 1600w\"  alt=\"\" width=\"201\" height=\"309\"></figure>\n<p>Five titles are officially associated with the Heroes Return relaunch / re-branding. The first is Avengers; the next three are solo books of the core Avengers members: Captain America, Iron Man, and Thor. The final Heroes Return title is Fantastic Four. It's the only title to change its entire creative team within the first few issues, which isn't a good sign.<br><br>After only three issues, writer Scott Lobdell is joined by Chris Claremont as a co-writer. By issue six, Scott's off the book and Chris is sole writer. I don't know if Marvel wasn't happy with Lobdell's direction, or if Lobdell had too many other projects and bowed out so Chris could give the book the attention it deserved. <br><br>Lobdell's issues have a particular interest in focusing on a single member of the Fantastic Four in each issue. Even the annual, released during Lobdell's tenure but written by Karl Kesel, is a one-shot mostly focused on the Thing. By contrast, Claremont's issues focus on the team coming together as a family and fighting off supervillains as a group. Neither approach is necessarily better, but it's an interesting contrast. <br><br>So far I haven't really found all that much to love about the title. The standout so far is that Kesel-penned annual, in which the Thing finds himself in an alternate reality where all the main Marvel superheroes have grown old. It's an engaging take on superheroes that's pretty uncommon. I've seen post-apocalyptic versions of Marvel superheroes elsewhere, like in the late 2000s epic Old Man Logan, but the FF annual just kinda shows them aging out of their roles in a very realistically human way. It's touching, and the only issue of the run so far that's really stuck with me.</p>\n<p> </p>\n<p class=\"align-center\"><strong>Fury / Agent 13 #1-2</strong></p>\n<p class=\"align-center\">[image forthcoming]</p>\n<p>Nick Fury's been missing in the Marvel Comics continuity for some time now (he does that semi-frequently over the years), and this two-parter uses Agent 13 as a focal point to tell the story of how he gets back to the main Marvel Universe. It's a decently fun little event series, and I really hope both of these characters show up in the near future again.</p>\n<p> </p>\n<p class=\"align-center\"><strong>Generation X #32-41</strong></p>\n<p class=\"align-center\">[image forthcoming]</p>\n<p>I was really excited for this one. Young superheroes are one of my favorite sub-genres, because the superhero genre is just so tailor-made to work well as a coming-of-age story for kids and teens. The X-Men have a reason built into their very premise to have a strong youth focus - I mean, their main homebase is a school - so I had high hopes for a title specifically focusing on the X-kids, especially one with Emma Frost and Jubilee in lead roles.<br><br>A few of the issues perfectly capture some of the jubilance and fun of being a kid with superpowers. The first issue I read is a DeFalco-penned story about Gen X foiling the Circus of Crime, famously a supervillain group that's about as intimidating as a bag of chips. There's a storyline of Gen X dealing with a kid who steals their things, and another one where they watch a scary movie and Jubilee has nightmares afterwards. Perfect.<br><br>Smack dab in the middle of all this is a long multi-part story about the kids hopping into a surreal fantasy land where nothing makes sense. Nothing about this is explained properly, so rather than being a fun romp, it's a tedious chore to read, and it goes on for ages. There's some cool stuff with a couple kids merging together to become a stronger superhero, but it gets lost in the noise. Too bad.</p>\n<p> </p>\n<p class=\"align-center\"><strong>Generation X Underground Special #1</strong></p>\n<p class=\"align-center\">[image forthcoming]</p>\n<p>For some reason, Marvel gave an unusual underground artist the reins to make a zine-like black-and-white one-shot of short stories about the Gen X team. They range in quality, but the unusual presentation and art style are super fun.</p>\n<p> </p>\n<p class=\"align-center\"><strong>Heroes for Hire #1-14</strong></p>\n<p class=\"align-center\">[image forthcoming]</p>\n<p>I had low expectations for this one, because none of the main cast of Heroes For Hire are among my favorite characters. Iron Fist and Hercules have kinda cool runs I read a bit of in the mid 2000s, but that's really it. Fascinatingly, Heroes For Hire ends up being one of the most fun romps of the year so far.<br><br>While Busiek's Avengers has had a pretty stable roster thus far, the Heroes (as penned by John Ostrander) have a roster that switches up something like every couple of issues. There's a LOT of characters coming from unusual places in the Marvel Universe - Scott Lang, She-Hulk, Black Knight, the Thunderbolts, the Punisher, and a new White Tiger all have prominent roles.<br><br>On top of that, the book's absolutely packed with plot. Since the Heroes For Hire are mercenaries, every character has their own agenda, and a lot of those agendas become significant sideplots. The book is never ever boring. Even the one-shot issues are fun: the latest one has Black Knight fighting a dragon in disguise as a Wall Street executive. Neat!<br><br>I'd say the book's one big misstep is how it handles Luke Cage. Early on in the series he's shown to be in league with the \"Master of the World\" (um, yuck??), a supervillain who's trying to depopulate the world. It's just all kinds of gross.</p>\n<p> </p>\n<p class=\"align-center\"><strong>Incredible Hulk #460-467</strong></p>\n<p class=\"align-center\">[image forthcoming]</p>\n<p>Here's the very end of Peter David's long, 100+ issue run on the title. Hulk doesn't reboot immediately for the Heroes Return event, but Bruce's return from that event's pocket universe does kick off a new storyline where Banner and Hulk try to work together again. There's a lot about the run that's super heartwarming - Thunderbolt Ross decides to try being nice to Hulk, Bruce works with Reed Richards to help Rick Jones learn to walk again, and Bruce/Hulk's marriage with Betty Ross flourishes.<br><br>Then, abruptly, in Peter David's penultimate issue, Betty dies from radiation overexposure. It's extremely sudden, devastating to the characters, and a *huge* mood whiplash. This is the last thing that Peter David leaves the new writers to deal with, because his final issue depicts an alternate future in which Hulk and the others come to terms with Betty's death. <br><br>I have to give Peter David some credit for finding a way to end his run, more or less definitively, on his own terms; you could really call this issue \"the end of the Hulk's story\" if you really wanted to. But since it's an alternate future, this still leaves a way out for the new writers to continue Hulk's story in the present day, and even bring Betty back to life later if they want to. Still, I wish Peter David had left himself more room to let the characters really struggle with this death, instead of merely making it a shock twist at the end of his run.</p>\n<p> </p>\n<p class=\"align-center\"><strong>Incredible Hulk &amp; Sub-Mariner Annual 1998</strong></p>\n<p class=\"align-center\">[image forthcoming]</p>\n<p>Namor's presence in Marvel Comics in 1998 is stronger than average - see Marvel Team-Up and Marvel Universe below for more on that. I really like Namor as a character - he's a grumpy little shit, but also has a strong moral compass and is fiercely protective of his family and his home. I love him.<br><br>This team-up continues Namor's story from Marvel Team-Up. Hulk is more of a guest-star, and is dealing with the immediate fallout of Betty's death in his own series. I kind of liked seeing these two damaged souls helping each other out, even if neither really did that much to directly address their own or each other's pain. </p>\n<p> </p>\n<p class=\"align-center\"><strong>Iron Fist vol 3 #1-2</strong></p>\n<p> </p>\n<p>Like I said before, Iron Fist isn't really one of my favorite characters, and this miniseries is an incredibly basic take on him. The plot's a bit confusing too. We'll see if the wrap-up is any good, but... so far I'm not a fan.</p>\n<p> </p>\n<p class=\"align-center\"><strong>Iron Man vol 3 #1-7</strong></p>\n<p class=\"align-center\">[image forthcoming]</p>\n<p>At his most basic, Iron Man is a guy who enjoys being a rich playboy way more than Bruce Wayne does, and often fights supervillains who are annoyed at Tony's company for one reason or another. That's more or less what we saw with the Iron Man movies, and it's also pretty much what we get here. <br><br>Now don't get me wrong: \"incredibly basic Iron Man\" is still reasonably entertaining, particularly the two-parter where Tony deals with a supervillain while trying to rescue an island town from an active volcano. I *liked* the Iron Man movies, and I had fun with this. But I don't know, this is Kurt Busiek on writing duties, and after Avengers and Thunderbolts I kind of expect more from him. He's not the only good writer I've seen stumble with Iron Man, either; and it's not bad writing, he just doesn't really have anything interesting to say with the character.</p>\n<p> </p>\n<p class=\"align-center\"><strong>Iron Man: The Iron Age #1</strong></p>\n<p class=\"align-center\">[image forthcoming]</p>\n<p>This is the first of a two-parter miniseries depicting Tony's early life as Iron Man, and how he first learned to balance his life inside and outside the suit, as narrated by Pepper Potts. Busiek makes the story feel epic, and lends it a fair bit of detail. I kind of wish Pepper had more to do, tho.</p>\n<p> </p>\n<p class=\"align-center\"><strong>Journey Into Mystery #517-521</strong></p>\n<p class=\"align-center\">[image forthcoming]</p>\n<p>After Thor vanished into a pocket universe for the Heroes Reborn event, his series was rebranded to its original title, Journey Into Mystery, from when it was a pulp adventure series in the 1950s and early 1960s. While Thor's gone, Journey Into Mystery becomes a vehicle for short features about other characters who don't have their own series. These 1998 issues feature Black Widow in a three-parter, and vampire detective Hannibal King in a two-parter.<br><br>The Black Widow story, penned by Scott Lobdell, is really freaking good! An old woman tells a government agent about how Black Widow fought a group of neo-Nazi revolutionaries, and he slowly comes to realize that she's an unreliable narrator. It's got some great twists and turns, and it's the most fun I've ever had with Black Widow as a character. Strong stuff, and again, better than I've come to expect from Scott Lobdell.<br><br>The story about the vampire detective is *so* boring by comparison. Hannibal King isn't a memorable or likeable character, he's not very heroic, and I didn't like how he treated the female characters.</p>\n<p> </p>\n<p class=\"align-center\"><strong>Ka-Zar vol 3 #1-16, Annual 1997</strong></p>\n<p class=\"align-center\">[image forthcoming]</p>\n<p class=\"align-center\">[image forthcoming]</p>\n<p class=\"align-center\">[image forthcoming]</p>\n<p>\"There is no way in hellfire they'll be able to make a *Ka-Zar* ongoing series interesting,\" I thought to myself. Well, for some reason, Marvel put Mark Waid on the first fourteen issues, Christopher Priest on the next batch, and Brian K. Vaughan on the annual, and those are three names you don't fuck around with in the comics industry. So, as a natural result, Ka-Zar is surprisingly good.<br><br>I don't find anything particularly interesting about the premise, which is basically that Ka-Zar, a caveman-like superhero, lives with his wife Shanna the She-Devil in the Savage Land. (Lotta superheroes are married in the late 90s - Hulk and Betty, Peter and Mary Jane, Cyclops and Jean Grey... it's a whole thing.) Ka-Zar's a fun guest star, but in his own book?<br><br>After a fakeout where Ka-Zar's own brother is the villain for the first few issues, Mark Waid throws fucking Thanos into the mix, calling the shots and attempting to escape his cosmic prison. In the climax of that storyline, Thanos turns New York City into a jungle, and Ka-Zar must race to save his family and homeland before it's overtaken by the surrounding Antarctic tundra. It's a lot of fun.<br><br>Then Christopher Priest sends Ka-Zar back to NYC and gives him a language impediment, where he can't understand anybody in NYC for mysterious reasons. He also throws the Punisher at him. It's a tonal shift from Waid's run, but it's just as fun.<br><br>I think Ka-Zar's and Shanna's relationship is... not great. She gets mad at him for having the hobby of playing with tech from the modern world, like Gameboys and radios, because she's worried that their presence in the Savage Land will hurt their child. I think it's an unreasonable overreaction that taints my view of their relationship for the rest of the run. But that's the strongest critique I have of an overall solid series.</p>\n<p> </p>\n<p class=\"align-center\"><strong>Machine Man &amp; Bastion Annual 1998</strong></p>\n<p class=\"align-center\">[image forthcoming]</p>\n<p>The writers of the Cable annual had a story long enough to fit into two issues, and with good reason - this is the comeuppance of a major villain from the X-Men's most recent event, \"Operation Zero Tolerance.\" This displays a unique benefit of the way Marvel structures its 1998 annuals: even tho there's no Machine Man series to write an annual for, Marvel can present a \"1998 Annual *Starring* Machine Man &amp; Bastion.\" Anyway, the issue's pretty good and probably would've had a lot more impact for me if I'd read the relevant event.</p>\n<p> </p>\n<p class=\"align-center\"><strong>Man-Thing vol 3 #1-8</strong></p>\n<p class=\"align-center\">[image forthcoming]</p>\n<p>Between 1997 and 1998, Marvel briefly brought back the classic 1960s pulp title Strange Tales - not merely as a single series, but as an entire brand. The series Man-Thing and Werewolf By Night both have the logo at the top left corner of the cover, as does the \"Strange Tales: Dark Corners\" one-shot reviewed later in this overview.<br><br>It doesn't sound like it worked out super well, because both Man-Thing and Werewolf By Night were cancelled before their storylines could reach a conclusion. Both characters were brought back later in 1998 for a new Strange Tales miniseries that was intended to conclude their storylines, but that also was cancelled halfway thru its four-issue run. Which is a shame, cause Werewolf By Night is good, and Man-Thing is excellent.<br><br>J.M. DeMatteis has a hell of an imagination - over the course of eight issues, dreams and nightmares and hallucinatory visions and interdimensional visits and planetary travel all flow into each other. Into this mix DeMatteis throws in the occasional random Marvel character - Doctor Strange, Howard the Duck, and Namor all make appearances. It's an imaginative Sandman-esque dreamscape, flowing easily from one issue to another without much care for clearly delineated storyline beginnings and endings. None of it would work without Liam Sharp, who inks his own pencils and creates a very dark and unnatural art style.<br><br>Right at the core of the book there's an extended sequence at an asylum. Not only is it handled tactfully, it's a decent treatment of mental illness. Man-Thing helps a traumatized patient grapple with his demons, at which point the patient decides to start trying to help other patients heal too. I can't say enough good things about this book.</p>",
            "author": {
                "name": "Harmony"
            },
            "tags": [
                   "Marvel Comics"
            ],
            "date_published": "2020-12-16T17:29:15-06:00",
            "date_modified": "2020-12-17T19:59:19-06:00"
        },
        {
            "id": "https://harmonymedia.github.io/projecttopia/marvel-comics-first-half-of-1998-part-1.html",
            "url": "https://harmonymedia.github.io/projecttopia/marvel-comics-first-half-of-1998-part-1.html",
            "title": "Marvel Comics: First Half of 1998, Part 1",
            "summary": "In the mid-2000s, I saw my first superhero film, and I saw it on the big screen. I ended up adoring Spider-Man 2, as I still do to this day, and immediately went to the bookstore to find Spider-Man comics to read. Marvel was publishing&hellip;",
            "content_html": "<p>In the mid-2000s, I saw my first superhero film, and I saw it on the big screen. I ended up adoring Spider-Man 2, as I still do to this day, and immediately went to the bookstore to find Spider-Man comics to read. Marvel was publishing the Essential series at the time, a series of black-and-white collections of the original 1960s books. I devoured every volume I could find, drinking in the soap opera and the rich world and the interesting characters. Occasionally, characters from elsewhere in the Marvel Universe would cameo, like Human Torch or Hulk or Thor, and I would wonder what was going on in their comics.</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://harmonymedia.github.io/projecttopia/media/posts/4/Intro-part-1-Essential-Spider-Man-1-3.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Intro-part-1-Essential-Spider-Man-1-3-xs.png 300w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Intro-part-1-Essential-Spider-Man-1-3-sm.png 480w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Intro-part-1-Essential-Spider-Man-1-3-md.png 768w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Intro-part-1-Essential-Spider-Man-1-3-lg.png 1024w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Intro-part-1-Essential-Spider-Man-1-3-xl.png 1360w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Intro-part-1-Essential-Spider-Man-1-3-2xl.png 1600w\"  alt=\"\" width=\"941\" height=\"474\"></figure>\n<p>In 2006, rather than going to a bookstore for the latest Essential volume, I walked into my local comic book store. There, I spotted the latest issue of Amazing Spider-Man on the shelf. The bottom half of the cover was a deep solid red, and other comics in the store had a similar design. I picked up the issue, along with an issue of Wolverine, and an event comic that seemed to tie the two together: Civil War #1.</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://harmonymedia.github.io/projecttopia/media/posts/4/Intro-part-2-Civil-War-tie-ins.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Intro-part-2-Civil-War-tie-ins-xs.png 300w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Intro-part-2-Civil-War-tie-ins-sm.png 480w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Intro-part-2-Civil-War-tie-ins-md.png 768w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Intro-part-2-Civil-War-tie-ins-lg.png 1024w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Intro-part-2-Civil-War-tie-ins-xl.png 1360w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Intro-part-2-Civil-War-tie-ins-2xl.png 1600w\"  alt=\"\" width=\"5992\" height=\"3064\"></figure>\n<p>The way superhero comics are written has evolved a lot over time, but especially over the last twenty years. As comics sales have struggled, Marvel and DC have thrown more and more ideas at the wall, never sticking with any one idea for very long. It's led to a more diverse stable of characters and some truly gripping long-form narratives, and it's even bled over into other forms of media, particularly blockbuster cinema.<br><br>So, because I'm a sucker for superheroes generally and Marvel specifically, I thought it'd be interesting to read the last twenty years of Marvel Comics and witness that evolution. It'd give me an excuse to read some of the all-time great comics runs along the way: Grant Morrison's X-Men, J. Michael Straczynski's Spider-Man, and Brian K. Vaughan's Runaways, just to name a few.</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://harmonymedia.github.io/projecttopia/media/posts/4/Intro-part-2.5-cool-stuff.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Intro-part-2.5-cool-stuff-xs.png 300w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Intro-part-2.5-cool-stuff-sm.png 480w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Intro-part-2.5-cool-stuff-md.png 768w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Intro-part-2.5-cool-stuff-lg.png 1024w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Intro-part-2.5-cool-stuff-xl.png 1360w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Intro-part-2.5-cool-stuff-2xl.png 1600w\"  alt=\"\" width=\"2142\" height=\"1080\"></figure>\n<p>It's a massive and probably ill-advised undertaking, but since when has that ever stopped me? I'm the one who tried to read all of Aristotle's philosophy and got stalled partway through Nicomachean Ethics.</p>\n<p> </p>\n<p class=\"align-center\"><strong>Where to Start</strong></p>\n<p>This is going to be a long journey, but it wasn't originally going to be as long as it now turns out it will be. Let me explain.<br><br>I knew I wanted to start reading *around* the time that Brian Michael Bendis took over the Avengers in the mid-2000s. I know that a number of other big runs started around then, and it was pretty close to my original jumping-on point, too.<br><br>But there's a few notable runs that start significantly before that, including the three I listed above (Morrison's X-Men, JMS' Spider-Man, and BKV's Runaways). And there's also Ultimate Marvel, an extremely influential line of comics which launched in 2000 and ran for about a solid decade and a half.</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://harmonymedia.github.io/projecttopia/media/posts/4/Intro-part-3-Ultimate-lineup.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Intro-part-3-Ultimate-lineup-xs.png 300w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Intro-part-3-Ultimate-lineup-sm.png 480w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Intro-part-3-Ultimate-lineup-md.png 768w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Intro-part-3-Ultimate-lineup-lg.png 1024w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Intro-part-3-Ultimate-lineup-xl.png 1360w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Intro-part-3-Ultimate-lineup-2xl.png 1600w\"  alt=\"\" width=\"1970\" height=\"980\"></figure>\n<p>So maybe Ultimate Marvel was where I should start looking. Well, I looked at the line-up in late 2000, and noticed that several notable comics were not too far into their run -- notably, the Marvel Knights line, which included reboots of Black Panther and Daredevil, among others. Those comics also have a lot of legacy associated with them. I backed up again.</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://harmonymedia.github.io/projecttopia/media/posts/4/Intro-part-4-MK-lineup.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Intro-part-4-MK-lineup-xs.png 300w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Intro-part-4-MK-lineup-sm.png 480w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Intro-part-4-MK-lineup-md.png 768w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Intro-part-4-MK-lineup-lg.png 1024w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Intro-part-4-MK-lineup-xl.png 1360w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Intro-part-4-MK-lineup-2xl.png 1600w\"  alt=\"\" width=\"3808\" height=\"1968\"></figure>\n<p>Turns out the Marvel Knights line started in 1998. Maybe 1998 should be my new starting point, I thought. But *then* I noticed that lots of the main Marvel titles, such as Fantastic Four and Avengers, had been very recently rebooted at that time. In fact, nearly every major Marvel property, except for the X-Men, received a reboot around 1998.<br><br>One more time I moved backwards on the timeline, and this time I found my starting point. In 1996, the supervillain Onslaught attacked the Marvel Universe, and several prominent superheroes seemed to sacrifice their lives to stop him. In reality, they ended up in a pocket universe, where their lives began anew, with new origins and backstories. Marvel outsourced this work to the house of Jim Lee and Rob Liefeld, and called the new reboot event \"Heroes Reborn.\"</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://harmonymedia.github.io/projecttopia/media/posts/4/Intro-part-5-Onslaught-reborn.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Intro-part-5-Onslaught-reborn-xs.png 300w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Intro-part-5-Onslaught-reborn-sm.png 480w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Intro-part-5-Onslaught-reborn-md.png 768w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Intro-part-5-Onslaught-reborn-lg.png 1024w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Intro-part-5-Onslaught-reborn-xl.png 1360w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Intro-part-5-Onslaught-reborn-2xl.png 1600w\"  alt=\"\" width=\"474\" height=\"377\"></figure>\n<p>This did not go over well with fans. So in 1997, Marvel brought all those heroes back to the main universe and rebooted all those titles *again* with the redundantly-named event \"Heroes Return.\" It's a new beginning with new creators on many titles, and an attempt to recapture some of what made classic Marvel Comics good. This relaunch seemed to be a solid starting point for my project.<br><br>A few very notable, very long-running titles also began around that time: the wise-cracking Deadpool and villains-turned-heroes Thunderbolts both launched around that time. So I started with those, along with the Heroes Return comics, and decided I'd pick up new series as they hit. Before too long, I'd picked up nearly every issue that got published in 1998, and went back a few months to pick up context, too. <br><br>(I got lucky with the X-Men. Even though they were not officially a part of Onslaught or Heroes Reborn/Return, they went thru an event of their own called Operation Zero Tolerance in 1997, so I began reading in that event's immediate aftermath.)</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://harmonymedia.github.io/projecttopia/media/posts/4/Intro-part-6-Starting-line-up.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Intro-part-6-Starting-line-up-xs.png 300w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Intro-part-6-Starting-line-up-sm.png 480w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Intro-part-6-Starting-line-up-md.png 768w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Intro-part-6-Starting-line-up-lg.png 1024w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Intro-part-6-Starting-line-up-xl.png 1360w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Intro-part-6-Starting-line-up-2xl.png 1600w\"  alt=\"\" width=\"2788\" height=\"1078\"></figure>\n<p>So this is my starting point. 1998, with twenty years to go until I catch up. There's a few issues from 1998 I didn't read: I skipped reprints, and I skipped Marvel's Star Trek comics, which were cancelled very early in 1998 anyway.<br><br>The plan is, every six to twelve months of reading, I'll write up a new analysis. See where Marvel's at, what's changed, how things are going. This first analysis will be a bit longer as it also has to cover some issues from 1997 that gave me context.</p>\n<p> </p>\n<p class=\"align-center\"><strong>Overall Impressions, Before We Begin</strong></p>\n<p>There's a very classic feel to many of these comics. Some of this is probably Marvel trying to recover from the intense tone of their mid 90s comics in general, and of the Onslaught and Heroes Reborn events in particular. But there's a few 90s-style badass grim action types still around in books like X-Force, Cable, Maverick, and Wolverine. <br><br>I've looked at the titles listed for January of 1999 for reference, and nearly all of Marvel's long-running titles are cancelled or rebooted in 1998, except for a few notable X-books. (Uncanny &amp; adjectiveless X-Men, X-Force, Generation X, Cable, Wolverine, and X-Man survive in the near future.) As far as I can tell, this is the closest Marvel's ever come to wiping the board clean and starting with all new #1 issues, at least until the repeated Marvel Now reboots of the 2010s.<br><br>There's some really good writing in here. Now I know why people like Kurt Busiek and J.M. DeMatteis are considered all-time greats - but I'll get to that later.</p>\n<p> </p>\n<p class=\"align-center\"><strong>Alpha Flight vol 2 #1-13</strong></p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://harmonymedia.github.io/projecttopia/media/posts/4/Alpha-Flight-v2-1-13.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Alpha-Flight-v2-1-13-xs.png 300w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Alpha-Flight-v2-1-13-sm.png 480w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Alpha-Flight-v2-1-13-md.png 768w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Alpha-Flight-v2-1-13-lg.png 1024w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Alpha-Flight-v2-1-13-xl.png 1360w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Alpha-Flight-v2-1-13-2xl.png 1600w\"  alt=\"\" width=\"2764\" height=\"1202\"></figure>\n<p>I was going to skip Alpha Flight, but they kept popping up in other series, so I finally picked it up. The core conceit is that Canada's premiere super-team is being manipulated by a corrupt government agency. The pacing is weird - I think it takes a little too long for the heroes to realize that their memories have been manipulated. A dozen issues in, and they're just now starting to shake off the effects.<br><br>Much like some other series I've read that don't seem to trust they'll survive past a year (Thunderbolts, Ka-Zar), Alpha Flight reaches a big climax at issue 12. It has an official crossover with Uncanny X-Men at one point, but otherwise is surprisingly self-contained given how much it was advertised elsewhere.<br><br>The highlight of these is certainly issue 13, an experimental issue which follows a government lackey instead of any of the main (and pretty forgettable) heroes. Otherwise, I think writer Steve Seagle limits the book, as he does over in Uncanny X-Men. He's just not evocative in his writing or rich in his characters. He's going for a classic superhero style, but in a way that's kinda drab and boring. I'm hoping the book turns around in its final half-year, but I'm not really expecting it to.</p>\n<p> </p>\n<p class=\"align-center\"><strong>Amazing Spider-Man #432-437</strong></p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://harmonymedia.github.io/projecttopia/media/posts/4/Amazing-Spider-Man-432-437.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Amazing-Spider-Man-432-437-xs.png 300w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Amazing-Spider-Man-432-437-sm.png 480w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Amazing-Spider-Man-432-437-md.png 768w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Amazing-Spider-Man-432-437-lg.png 1024w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Amazing-Spider-Man-432-437-xl.png 1360w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Amazing-Spider-Man-432-437-2xl.png 1600w\"  alt=\"\" width=\"7536\" height=\"1964\"></figure>\n<p>In 1998, Bob Harras was the Editor-in-Chief at Marvel Comics. (He would go on to become the EIC at DC Comics in the 2010s.) He wanted a Spider-Man event that would rival X-Men's Age of Apocalypse, a mid-90s event that temporarily completely changed the status quo, down to ending all of the main X-books for a couple of months and replacing them with alternate universe equivalents. Harras' brainchild for the Spider-Man comics, \"The Clone Saga,\" ended up being overlong and detested by fans. You could understand why I was perhaps a little hesitant to pick up the series involving one of my all-time favorite superheroes.<br><br>But Spider-Man in 1998 is, lo and behold, somehow quite good. There's four series running at the time: Amazing from the 60s, Spectacular from the 70s, adjectiveless Spider-Man from the early 90s, and Sensational from the late 90s. The books are so tightly edited that at times it feels less like reading four monthly Spider-Man titles and more like reading one weekly Spider-Man series, especially whenever they all cross over for a big event.<br><br>This stretch of issues has two events. The first is Spider-Hunt, which follows Spider-Man as he flees mercenaries and tries to rescue Norman Osborn's son. It's a good example of how tightly edited these books are; Spider-Hunt reads like one four-part story across issues from four different series. <br><br>The second event is Identity Crisis, which I think is not only the stronger of the two events, but also one of the better-conceived events I've ever read in a Spider-Man series. The concept is that Spider-Man, still on the run, has decided to adopt a new persona so he can keep fighting crime while staying safe. Peter has understandably come to the conclusion that Spider-Man disappearing at the same time a new hero appears would clue people in to what's going on, so he adopts *four* new identities all at once, two heroic and two... less so. This lets the writers of each series have a little more creative leeway, since each gets to write the adventures of only *one* of the four new personas. It's a strong concept, and the writers all seemed to have a lot of fun with it.<br><br>That brings us to the '98 writer of Amazing, Tom DeFalco. He's a fill-in writer in a lot of other places this month, and he's written about half the What If issues I've read, but this is his main book. For the longest-running Spider-Man book of all time, he's a solid choice. DeFalco has a very traditional style, from his dialogue to his plotting. I think Amazing takes the fewest risks of the four Spider-titles - the villainous character DeFalco's obsessed with, Black Tarantula, is really nothing to write home about - but it's also not the worst of them, and occasionally has a really stand-out issue, such as when Spidey uses all four of his new identities at once to fight supervillains. I particularly enjoyed the crossover with Generation X where Peter turned into a monstrous half-spider, but I'm kind of a sucker for weird shapeshifting stuff.</p>\n<p> </p>\n<p class=\"align-center\"><strong>Amazing Spider-Man &amp; Devil Dinosaur Annual 1998</strong></p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://harmonymedia.github.io/projecttopia/media/posts/4/Amazing-Spider-Man-and-Devil-Dinosaur-Annual-1998.jpg\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Amazing-Spider-Man-and-Devil-Dinosaur-Annual-1998-xs.jpg 300w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Amazing-Spider-Man-and-Devil-Dinosaur-Annual-1998-sm.jpg 480w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Amazing-Spider-Man-and-Devil-Dinosaur-Annual-1998-md.jpg 768w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Amazing-Spider-Man-and-Devil-Dinosaur-Annual-1998-lg.jpg 1024w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Amazing-Spider-Man-and-Devil-Dinosaur-Annual-1998-xl.jpg 1360w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Amazing-Spider-Man-and-Devil-Dinosaur-Annual-1998-2xl.jpg 1600w\"  alt=\"\" width=\"229\" height=\"351\"></figure>\n<p>Marvel's gimmick for 1998 annuals is that every single one is a two-character crossover. It's a pretty good idea - if you don't care about one character, you might care about the other - and as far as I can tell, this is the only time in history that Marvel has ever done this. Devil Dinosaur &amp; Moon Boy aren't all that interesting, and the Circus of Crime is never really a formidable enemy, but the issue's okay. I look forward to Devil Dinosaur getting his female companion in the 2010s. </p>\n<p> </p>\n<p class=\"align-center\"><strong>Avengers vol 3 #1-7</strong></p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://harmonymedia.github.io/projecttopia/media/posts/4/Avengers-v3-1-7.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Avengers-v3-1-7-xs.png 300w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Avengers-v3-1-7-sm.png 480w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Avengers-v3-1-7-md.png 768w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Avengers-v3-1-7-lg.png 1024w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Avengers-v3-1-7-xl.png 1360w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Avengers-v3-1-7-2xl.png 1600w\"  alt=\"\" width=\"4796\" height=\"1076\"></figure>\n<p>I don't know at what point Avengers became Marvel's showcase blockbuster crossover comic. Maybe to some degree it always was; what with all the B-tier characters coming together, its inherent crossover nature is a bit of a distillation of some of the core of what Marvel Comics is all about: many heroes in a single unified universe.<br><br>Anyway, Kurt Busiek takes that idea and runs with it, and just damn this is a beautiful bombast of a thing. Busiek's Avengers is considered one of the all-time great runs; now I know why. It starts with a classic lineup - Iron Man, Captain America, Thor, Hawkeye, Scarlet Witch, Vision, Carol Danvers, and two New Warriors. It's absolute bloody chaos - within the first issue, the Avengers lose a fight that causes all of reality to shift to a medieval fantasy for a couple issues. I give George Perez and the art team a lot of credit for taking complicated setups and making it all look cohesive and bold. This was easily one of the most *fun* series to read in this whole thing.<br><br>Now: Busiek is also writing Thunderbolts, and I'll get to that one, but here's a tease: Thunderbolts has some of my favorite writing in this whole project. Its characters are freaking incredible - and the character writing in Avengers is just not quite up to that level. Given how iconic these Avengers are, and how Busiek was able to pretty much create the Thunderbolts himself, it's clear to see why. This isn't a character-driven comic, it's a blockbuster action film. And that's fine.<br><br>When the book does go for character drama, it stumbles. Busiek's a core orchestrator of the first big crossover of 1998, \"Live Kree Or Die,\" which tells a four-part story across four series: Iron Man, Captain America, Avengers, and (of all things) Quicksilver. The core of that story is the Avengers trying and failing to stage an intervention for Carol Danvers, who's lost some of her superpowers and has resorted to alcohol. It's a messy story that's super disappointing given how great of a character Carol will be in the mid 2010s, when she becomes the new Captain Marvel.</p>\n<p> </p>\n<p class=\"align-center\"><strong>Avengers &amp; Squadron Supreme Annual 1998</strong></p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://harmonymedia.github.io/projecttopia/media/posts/4/Avengers-and-Squadron-Supreme-Annual-1998.jpg\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Avengers-and-Squadron-Supreme-Annual-1998-xs.jpg 300w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Avengers-and-Squadron-Supreme-Annual-1998-sm.jpg 480w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Avengers-and-Squadron-Supreme-Annual-1998-md.jpg 768w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Avengers-and-Squadron-Supreme-Annual-1998-lg.jpg 1024w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Avengers-and-Squadron-Supreme-Annual-1998-xl.jpg 1360w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Avengers-and-Squadron-Supreme-Annual-1998-2xl.jpg 1600w\"  alt=\"\" width=\"249\" height=\"382\"></figure>\n<p>One of the early Avengers storylines involves them battling Squadron Supreme, a superteam I didn't find to be all that remarkable. The Avengers find the Squadron kind of annoying because the Squadron is being mind-controlled for the umpteenth time, and I couldn't help agreeing with them. This annual finishes off the Squadron's storyline with the Avengers, and sends the Squadron back to their own universe, where they'll finish their story in a one-shot later this year. It's a decently satisfying conclusion that's been oddly shunted out of the main series, but frankly freeing up time to deal with other more interesting foes in the main series is something I'm fine with.</p>\n<p> </p>\n<p class=\"align-center\"><strong>Cable #48-57</strong></p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://harmonymedia.github.io/projecttopia/media/posts/4/Cable-48-57.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Cable-48-57-xs.png 300w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Cable-48-57-sm.png 480w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Cable-48-57-md.png 768w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Cable-48-57-lg.png 1024w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Cable-48-57-xl.png 1360w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Cable-48-57-2xl.png 1600w\"  alt=\"\" width=\"6384\" height=\"3924\"></figure>\n<p>Of the three X-Men solo books starring grim and gritty dudes, Cable has the strongest reason to exist: Cable's from the future and trying to stop shit going down that'll cause disaster in his home time. This doesn't play a major plot role in every single issue, but it is kinda always in the background and definitely gets mentioned every month, which gives you a little more of a hook to keep coming back - what's gonna happen, is he gonna fix everything?<br><br>The six-parter I started out with, The Hellfire Hunt, is the strongest writing in the book that I've seen yet, and also the most relevant to that core plot. Since then the comic has generally leaned on guest characters like Domino and Ulysses Klaw, but it's still been reasonably entertaining, and I'm someone who can get tired of the Grim Superhero Guy genre *real* fast. Especially a guy like Cable, relic of the 90s grimfest that was Marvel Comics, who looks like he has an entire kitchen pantry glued to his outfit.</p>\n<p> </p>\n<p class=\"align-center\"><strong>Cable &amp; Machine Man Annual 1998</strong></p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://harmonymedia.github.io/projecttopia/media/posts/4/Cable-and-Machine-Man-Annual-1998.jpg\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Cable-and-Machine-Man-Annual-1998-xs.jpg 300w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Cable-and-Machine-Man-Annual-1998-sm.jpg 480w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Cable-and-Machine-Man-Annual-1998-md.jpg 768w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Cable-and-Machine-Man-Annual-1998-lg.jpg 1024w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Cable-and-Machine-Man-Annual-1998-xl.jpg 1360w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Cable-and-Machine-Man-Annual-1998-2xl.jpg 1600w\"  alt=\"\" width=\"242\" height=\"372\"></figure>\n<p>This is really the only Cable issue I've read that touches on the post-Onslaught event most of the X-books went thru, \"Operation Zero Tolerance.\" Cable faces the villain of that event (Bastion) and also a brainwashed Machine Man. It's extremely basic.</p>\n<p> </p>\n<p class=\"align-center\"><strong>Captain America vol 3 #1-8</strong></p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://harmonymedia.github.io/projecttopia/media/posts/4/Captain-America-v3-1-8.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Captain-America-v3-1-8-xs.png 300w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Captain-America-v3-1-8-sm.png 480w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Captain-America-v3-1-8-md.png 768w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Captain-America-v3-1-8-lg.png 1024w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Captain-America-v3-1-8-xl.png 1360w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Captain-America-v3-1-8-2xl.png 1600w\"  alt=\"\" width=\"1540\" height=\"1204\"></figure>\n<p>Mark Waid's a super solid writer, and has stuck with Marvel all the way thru 2019. Volume 3 is actually the second part of his run on Captain America, but it's a fine jumping-on point.<br><br>The overall Big Question that Waid's run grapples with is, what are the ramifications of being worshipped as a hero? (X-Man is dealing with this question in his own comic, too.) It runs through the whole series right up to the three-part climactic \"Power &amp; Glory\" storyline, in which an alien Skrull impersonates Captain America and uses the trust people have in Cap to announce a Skrull invasion that hasn't actually happened, thus spreading paranoia and fear. I don't think the comic handles it all that well - mostly, Steve mopes for a while, but otherwise he doesn't really do anything he wouldn't have done otherwise.<br><br>On the other hand, some of the things this series does are really fun. Waid's great at setpieces, like when Cap has to escort two kids thru a museum, or when Cap fights Hydra on a boat and loses his shield. Waid's also not afraid to handicap Steve to raise the stakes. I've had fun with this title.</p>\n<p> </p>\n<p class=\"align-center\"><strong>Daredevil #373-378</strong></p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://harmonymedia.github.io/projecttopia/media/posts/4/Daredevil-373-378.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Daredevil-373-378-xs.png 300w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Daredevil-373-378-sm.png 480w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Daredevil-373-378-md.png 768w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Daredevil-373-378-lg.png 1024w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Daredevil-373-378-xl.png 1360w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Daredevil-373-378-2xl.png 1600w\"  alt=\"\" width=\"2464\" height=\"630\"></figure>\n<p>Daredevil is one of those characters who can get so far into dark noir tone territory that I can barely tell what's going on. And indeed that is the case for the first two or three issues, co-written by Joe Kelly. Kelly has a bit of a mixed reputation with me so far in this project - his Deadpool is all over the place, but his X-Men is some of my favorite comics of 1998.<br><br>Once other writers come into play, Daredevil gets much better. Chris Claremont helps write the finale to the storyline where Karen Page is under investigation, so the issue when the trial takes place is really solid, even with a supernatural enemy mucking up proceedings.<br><br>Then Scott Lobdell of all people comes in to write a four-parter called Flying Blind, and this is some of the best Lobdell I've ever seen. The premise is that Daredevil's had his memories rewritten for a covert SHIELD mission, and the one SHIELD agent looking out for him and directing him is killed by mistake. It's up to Daredevil to figure out who he is and how to get home with no memories or outside help. That's a solid hook! And the drama is really good, with Matt's friends at home trying to find him, and Matt's villains recognizing him long before he's figured out why they know him.</p>\n<p> </p>\n<p class=\"align-center\"><strong>Daredevil vol 2 #1/2</strong></p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://harmonymedia.github.io/projecttopia/media/posts/4/Daredevil-vol-2-0.5.jpg\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Daredevil-vol-2-0.5-xs.jpg 300w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Daredevil-vol-2-0.5-sm.jpg 480w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Daredevil-vol-2-0.5-md.jpg 768w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Daredevil-vol-2-0.5-lg.jpg 1024w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Daredevil-vol-2-0.5-xl.jpg 1360w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Daredevil-vol-2-0.5-2xl.jpg 1600w\"  alt=\"\" width=\"272\" height=\"421\"></figure>\n<p>This is just Kingpin telling Mysterio about Daredevil's past in a prose issue that's meant to set up the soon-to-be-launched new volume of Daredevil. It's fine, albeit a bit of a perplexing release.</p>\n<p> </p>\n<p class=\"align-center\"><strong>Deadpool #1-19</strong></p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://harmonymedia.github.io/projecttopia/media/posts/4/Deadpool-1-19.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Deadpool-1-19-xs.png 300w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Deadpool-1-19-sm.png 480w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Deadpool-1-19-md.png 768w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Deadpool-1-19-lg.png 1024w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Deadpool-1-19-xl.png 1360w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Deadpool-1-19-2xl.png 1600w\"  alt=\"\" width=\"6600\" height=\"5008\"></figure>\n<p>Deadpool had a couple of limited series before this outing, \"The Circle Chase\" and \"Sins of the Past.\" Both hit in the mid-90s and both were part of the dark edgy violent 90s crowd. The Deadpool that 2020 audiences know and love - always wise-cracking, and frequently breaking the fourth wall - first got codified in this, his first ongoing series.<br><br>Over the years, the best Deadpool stories I've encountered have used Deadpool's jokiness as a front for some really tough questions about heroism in the face of trauma, and about Deadpool's very identity. Joe Kelly starts to get into some of that here, but it hasn't yet been refined. In one storyline, Deadpool stages a prison break for Typhoid Mary, a woman with multiple personalities. She proceeds to test his heroism by killing people, to see if he'll unheroically take her down to stop her. In the process, Deadpool's ideas of himself as a hero break down because he doesn't know the right thing to do - he doesn't want to hurt Mary who's obviously suffering, but his hesitation causes other people to die.<br><br>Deadpool only has stories like that every so often at this point, though. The biggest flaw I find with this series so far is how much of a chore it can be to read. Deadpool's a very wordy character, and a lot of the jokes don't land. I also don't like the story's treatment of Blind Al. She's a blind old lady who serves as Deadpool's companion, and early in the series it's unclear if she's his prisoner, or if she's just hanging around cause Deadpool's not actually all that menacing to her and cause she has nothing better to do. Later in the series, though, he tortures her by placing her in solitary confinement, and when she gets out her first reaction is to... try to change him for the better. Rather than fleeing Deadpool and his abusive treatment, she stays because she cares about him too much. This sucks.</p>\n<p> </p>\n<p class=\"align-center\"><strong>Deadpool &amp; Death Annual 1998</strong></p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://harmonymedia.github.io/projecttopia/media/posts/4/Deadpool-and-Death-Annual-1998.jpg\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Deadpool-and-Death-Annual-1998-xs.jpg 300w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Deadpool-and-Death-Annual-1998-sm.jpg 480w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Deadpool-and-Death-Annual-1998-md.jpg 768w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Deadpool-and-Death-Annual-1998-lg.jpg 1024w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Deadpool-and-Death-Annual-1998-xl.jpg 1360w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Deadpool-and-Death-Annual-1998-2xl.jpg 1600w\"  alt=\"\" width=\"249\" height=\"381\"></figure>\n<p>This issue combines the prologue to a multi-parter in the main series with a retelling of Deadpool's origins. It's pretty useful considering I never read the original two limited series and have no interest in doing so.</p>\n<p> </p>\n<p class=\"align-center\"><strong>Elektra #1-19</strong></p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://harmonymedia.github.io/projecttopia/media/posts/4/Elektra-1-19.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Elektra-1-19-xs.png 300w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Elektra-1-19-sm.png 480w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Elektra-1-19-md.png 768w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Elektra-1-19-lg.png 1024w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Elektra-1-19-xl.png 1360w ,https://harmonymedia.github.io/projecttopia/media/posts/4/responsive/Elektra-1-19-2xl.png 1600w\"  alt=\"\" width=\"6600\" height=\"5008\"></figure>\n<p>Elektra is the worst comic I've read in this project so far. For a long time, that dubious honor went to X-Man, and I'll get to why later. But then I struggled thru this series of issues and X-Man lost its crown.<br><br>Everything about this series is absurdly gross and sexist as fuck. The dialogue leers at Elektra's features like a horny twelve-year-old. The plot sees men taking advantage of Elektra over and over, both villain and hero alike. (Daredevil is her lover for an entire two issues before dumping her.) The art puts her in impossible poses constantly so her boobs and butt are always on display. The stories are boring and unoriginal, the guest characters are often written completely out of character, and Elektra herself is pretty unlikeable. She deserves better.<br><br>There's a couple of side characters that I did end up growing to like. Elektra has a dance instructor towards the beginning of the series, who starts out pretty unlikeable, but then a villain's scheme ends up permanently swapping him into the body of a young woman. I liked seeing him come to grips with that. And Elektra has a young ward named Nina who is briefly brainwashed by the Hand ninjas before she and Elektra save each other. Unfortunately, the series ends on a huge cliffhanger, with Nina having turned evil again, and the world on the hunt for Elektra. As far as I can tell, that cliffhanger won't be resolved anytime soon. Good riddance. Elektra, and Marvel, deserve better than this.</p>",
            "author": {
                "name": "Harmony"
            },
            "tags": [
                   "Marvel Comics"
            ],
            "date_published": "2020-12-07T16:51:01-06:00",
            "date_modified": "2020-12-16T17:29:58-06:00"
        },
        {
            "id": "https://harmonymedia.github.io/projecttopia/retro-games-1979-1983.html",
            "url": "https://harmonymedia.github.io/projecttopia/retro-games-1979-1983.html",
            "title": "Retro Games: 1979-1983",
            "summary": "1979 SHERIFF Arcade This is a two-joystick shooter where you play a sheriff in the middle of an open field, shooting at targets around you. It's sort of like Space Invaders, but with four directions to shoot at instead of two. It's a bit awkward&hellip;",
            "content_html": "<p class=\"align-center\"><strong>1979</strong></p>\n<p class=\"align-center\"><strong>SHERIFF<br></strong>Arcade</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://harmonymedia.github.io/projecttopia/media/posts/3/Sheriff.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Sheriff-xs.png 300w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Sheriff-sm.png 480w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Sheriff-md.png 768w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Sheriff-lg.png 1024w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Sheriff-xl.png 1360w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Sheriff-2xl.png 1600w\"  alt=\"\" width=\"440\" height=\"570\"></figure>\n<p class=\"align-left\">This is a two-joystick shooter where you play a sheriff in the middle of an open field, shooting at targets around you. It's sort of like Space Invaders, but with four directions to shoot at instead of two. It's a bit awkward to control, but as shooters go it's okay.</p>\n<p> </p>\n<p class=\"align-center\"><strong>1980</strong></p>\n<p class=\"align-center\"><strong>PAC-MAN<br></strong>Arcade<br>Played on PC</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://harmonymedia.github.io/projecttopia/media/posts/3/Pac-Man-2.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Pac-Man-2-xs.png 300w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Pac-Man-2-sm.png 480w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Pac-Man-2-md.png 768w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Pac-Man-2-lg.png 1024w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Pac-Man-2-xl.png 1360w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Pac-Man-2-2xl.png 1600w\"  alt=\"\" width=\"458\" height=\"579\"></figure>\n<p>Some of these first few could be introduced with \"this needs no introduction.\" So, Pac-Man, the ultimate maze game. I have a fair bit of affection for it because I played it a lot growing up. But I dunno, it's a bit hard for me to go back to right now, for some reason. Well-designed, but I can only play it a little before I get bored.</p>\n<p> </p>\n<p class=\"align-center\"><strong>GAME &amp; WATCH</strong></p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://harmonymedia.github.io/projecttopia/media/posts/3/Game-and-Watch-2.PNG\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Game-and-Watch-2-xs.PNG 300w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Game-and-Watch-2-sm.PNG 480w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Game-and-Watch-2-md.PNG 768w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Game-and-Watch-2-lg.PNG 1024w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Game-and-Watch-2-xl.PNG 1360w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Game-and-Watch-2-2xl.PNG 1600w\"  alt=\"\" width=\"491\" height=\"299\"></figure>\n<p>I'm gonna do something weird on this one. It was hard for me to find a way to play the original G&amp;W games, so I'm gonna kick this one down the road. Later on the list, I've added the G&amp;W Gallery games for the Gameboy series of consoles, and I'll try them out thru that.</p>\n<p> </p>\n<p class=\"align-center\"><strong>1981</strong></p>\n<p class=\"align-center\"><strong>DONKEY KONG<br></strong>Arcade<br>Played NES port on Switch</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://harmonymedia.github.io/projecttopia/media/posts/3/Donkey-Kong.jpg\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Donkey-Kong-xs.jpg 300w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Donkey-Kong-sm.jpg 480w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Donkey-Kong-md.jpg 768w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Donkey-Kong-lg.jpg 1024w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Donkey-Kong-xl.jpg 1360w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Donkey-Kong-2xl.jpg 1600w\"  alt=\"\" width=\"569\" height=\"412\"></figure>\n<p>I finished this! Well, the NES version on Switch, which only has three of the four stages, but still. This was a lot of fun, the physics are good and you kinda start to figure out strategies for dealing with enemies and obstacles. And it's neat that you can get to an ending if you put a little time in.</p>\n<p> </p>\n<p class=\"align-center\"><strong>GALAGA<br></strong>Arcade<br>Played on PC</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://harmonymedia.github.io/projecttopia/media/posts/3/Galaga.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Galaga-xs.png 300w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Galaga-sm.png 480w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Galaga-md.png 768w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Galaga-lg.png 1024w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Galaga-xl.png 1360w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Galaga-2xl.png 1600w\"  alt=\"\" width=\"464\" height=\"583\"></figure>\n<p>This is basically more-exciting Space Invaders, and kind of like Pac-Man, it's a little hard for me to go back to. I don't have hard-and-fast rules for this marathon, but if I get the sense that I've seen most of what there is to see within a couple of levels, I won't really have the motivation to keep playing, and that's what this is like. It's a game to see how far you can get and how high you can score, but for me that's about it.</p>\n<p> </p>\n<p class=\"align-center\"><strong>1982</strong></p>\n<p class=\"align-center\"><strong>MS. PAC-MAN<br></strong>Arcade</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://harmonymedia.github.io/projecttopia/media/posts/3/Ms-Pac-Man.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Ms-Pac-Man-xs.png 300w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Ms-Pac-Man-sm.png 480w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Ms-Pac-Man-md.png 768w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Ms-Pac-Man-lg.png 1024w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Ms-Pac-Man-xl.png 1360w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Ms-Pac-Man-2xl.png 1600w\"  alt=\"\" width=\"435\" height=\"562\"></figure>\n<p>Pac-Man with a couple twists and new maps, but other than that my thoughts are pretty much the same as vanilla flavor Pac-Man.</p>\n<p> </p>\n<p class=\"align-center\"><strong>DONKEY KONG JR.<br></strong>Arcade<br>Played NES port on Switch</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://harmonymedia.github.io/projecttopia/media/posts/3/Donkey-Kong-Jr.jpg\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Donkey-Kong-Jr-xs.jpg 300w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Donkey-Kong-Jr-sm.jpg 480w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Donkey-Kong-Jr-md.jpg 768w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Donkey-Kong-Jr-lg.jpg 1024w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Donkey-Kong-Jr-xl.jpg 1360w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Donkey-Kong-Jr-2xl.jpg 1600w\"  alt=\"\" width=\"583\" height=\"465\"></figure>\n<p>I finished this too! And liked it a lot. This is gonna sound weird, but this is the game that made me understand why Shigeru Miyamoto is one of the most revered game developers of all time. DK Jr., like most of the arcade titles of the time, is a single-screen game. And yet each level feels like a multi-tiered adventure. You have to dodge and weave back and forth across the screen, thru different types of zones, to get to the top. It's neat as hell how much is squeezed into this.</p>\n<p> </p>\n<p class=\"align-center\"><strong>POPEYE<br></strong>Arcade<br>Played on NES</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://harmonymedia.github.io/projecttopia/media/posts/3/Popeye-2.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Popeye-2-xs.png 300w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Popeye-2-sm.png 480w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Popeye-2-md.png 768w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Popeye-2-lg.png 1024w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Popeye-2-xl.png 1360w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Popeye-2-2xl.png 1600w\"  alt=\"\" width=\"590\" height=\"516\"></figure>\n<p>Finished this one. Unlike the DK series, this game is about running around collecting things that Olive is throwing at you. But like those games, there's just a few stages, so with a little effort you can get to an ending. And I liked this, it's a bit basic but it's pretty cute.</p>\n<p> </p>\n<p class=\"align-center\"><strong>1983</strong></p>\n<p class=\"align-center\"><strong>JETPAC<br></strong>ZX Spectrum<br>Played on Xbox One</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://harmonymedia.github.io/projecttopia/media/posts/3/Jetpac.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Jetpac-xs.png 300w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Jetpac-sm.png 480w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Jetpac-md.png 768w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Jetpac-lg.png 1024w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Jetpac-xl.png 1360w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Jetpac-2xl.png 1600w\"  alt=\"\" width=\"565\" height=\"428\"></figure>\n<p>First game in the Rare Replay catalog. I wasn't expecting much from a 1983 ZX Spectrum game, but this is fun to play, has clear objectives, controls surprisingly well, and runs really smoothly. You play as an astronaut with a little jetpack trying to put his ship together and fill it with fuel while avoiding aliens. I guess my biggest gripe is that your shooting radius sucks so it's hard to shoot at aliens that are coming for you at an angle. I didn't feel compelled to play a lot of this, but it's a lot more fun to play with than I expected.</p>\n<p> </p>\n<p class=\"align-center\"><strong>MARIO BROS.<br></strong>Arcade<br>Played NES port on Switch<br>Played on GBA</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://harmonymedia.github.io/projecttopia/media/posts/3/Mario-Bros.jpg\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Mario-Bros-xs.jpg 300w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Mario-Bros-sm.jpg 480w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Mario-Bros-md.jpg 768w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Mario-Bros-lg.jpg 1024w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Mario-Bros-xl.jpg 1360w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Mario-Bros-2xl.jpg 1600w\"  alt=\"\" width=\"594\" height=\"442\"></figure>\n<p>You play as Mario (&amp; Luigi) running around a single screen trying to defeat various enemies. The original (well, the NES port) has absolutely terrible physics. That surprised me. All the other Mario/DK series ports have been pretty decent to control so far, but Mario just does not behave the way you expect him to here, and so I couldn't get very far. Then I popped a GBA port of the game in and it controlled a LOT better, I got a lot farther, and I had a lot more fun.</p>\n<p> </p>\n<p class=\"align-center\"><strong>BOMBERMAN<br></strong>PC<br>Played on NES</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://harmonymedia.github.io/projecttopia/media/posts/3/Bomberman-2.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Bomberman-2-xs.png 300w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Bomberman-2-sm.png 480w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Bomberman-2-md.png 768w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Bomberman-2-lg.png 1024w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Bomberman-2-xl.png 1360w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Bomberman-2-2xl.png 1600w\"  alt=\"\" width=\"640\" height=\"559\"></figure>\n<p>I don't think I can make it thru all 50 levels of Bomberman. It feels like there's a lot of randomness inherent: the enemy movements aren't completely predictable, and the hidden exit location is hidden in a random location each time. Maybe you'll get lucky and get the exit right away, or maybe it'll take you a while. Bomberman moves slowly and the bombs are less powerful than I expected. I started out sort of annoyed by this game.</p>\n<p>But I dunno, something about it is really compelling. Maybe the search, and the slight unpredictableness of the hunting down enemies, are both inherently enough to make me go \"maybe THIS time I've got this.\" Maybe the randomness is low enough that I keep thinking I'll be able to find a new strategy that'll lower it. It's kind of like Minesweeper but with enemies, and that's a pretty good way to improve Minesweeper. I could see myself sinking a lot of time into this, and I had a hard time pulling myself away from it. No wonder they made so many sequels.</p>\n<p> </p>\n<p class=\"align-center\"><strong>DONKEY KONG 3<br></strong>Arcade<br>Played NES port on Switch</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://harmonymedia.github.io/projecttopia/media/posts/3/Donkey-Kong-3.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Donkey-Kong-3-xs.png 300w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Donkey-Kong-3-sm.png 480w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Donkey-Kong-3-md.png 768w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Donkey-Kong-3-lg.png 1024w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Donkey-Kong-3-xl.png 1360w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Donkey-Kong-3-2xl.png 1600w\"  alt=\"\" width=\"603\" height=\"436\"></figure>\n<p>Growing up, this was my favorite of the main Donkey Kong games, maybe cause it's just so different. Something about pushing Kong up with the pesticide is really satisfying.</p>\n<p>Now, it's still fun, but it's not as structured as the other Miyamoto games I've played so far, so there isn't really as much of a sense of pacing. I can't really get to a point where I feel like I've finished DK3. The stages loop, but not always quite in the same order, and it keeps adding new insect types. Pacing-wise it's more similar to Bomberman or Mario Bros.</p>\n<p>Nothing wrong with that! But it is harder for me to stick with.</p>\n<p> </p>\n<p class=\"align-center\"><strong>BASEBALL<br></strong>NES<br>Played on Switch</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://harmonymedia.github.io/projecttopia/media/posts/3/Baseball-2.jpg\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Baseball-2-xs.jpg 300w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Baseball-2-sm.jpg 480w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Baseball-2-md.jpg 768w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Baseball-2-lg.jpg 1024w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Baseball-2-xl.jpg 1360w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Baseball-2-2xl.jpg 1600w\"  alt=\"\" width=\"587\" height=\"455\"></figure>\n<p>I'm not sure the pixelly 8-bit sports games Nintendo launched with the NES as part of the black box line are gonna do all that much for me. I mean, how much sports strategy can you actually simulate with a D-pad and two buttons?</p>\n<p>Now, baseball games are LONG, and unlike some other sports games where you can speed the clock up so it'll take less time, there's no real way to speed up a baseball game. You gotta sit thru the whole thing. But that's kinda weirdly relaxing in a way. There's a rhythm to it, and there's time for some real drama. Usually what happens in these is I make some colossal fuck-up partway thru cause I pushed the wrong button, and then I spend the rest of the game trying to fix my mistake, to no avail.</p>\n<p>There's different ways to pitch (is there strategy to that? I can certainly pretend there is), and a little bit of skill to when to hit and when to run. And that's just about as much input as I need in an 8-bit baseball game. I've tried RBI Baseball (also for NES), where you actually have to make the runners run thru the outfield, and that was painful. But this kind of works.</p>\n<p> </p>\n<p class=\"align-center\"><strong>DONKEY KONG JR. MATH<br></strong>NES</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://harmonymedia.github.io/projecttopia/media/posts/3/Donkey-Kong-Jr-Math.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Donkey-Kong-Jr-Math-xs.png 300w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Donkey-Kong-Jr-Math-sm.png 480w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Donkey-Kong-Jr-Math-md.png 768w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Donkey-Kong-Jr-Math-lg.png 1024w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Donkey-Kong-Jr-Math-xl.png 1360w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Donkey-Kong-Jr-Math-2xl.png 1600w\"  alt=\"\" width=\"603\" height=\"504\"></figure>\n<p>It's the elements of DK Jr., rearranged to create a math tutor game. This is the sort of game that your grandmother gets you when she hears you likes games, but wants to get you something wholesome, without so much of that violence in most video games I hear about, sonny. It's not very good.</p>\n<p> </p>\n<p class=\"align-center\"><strong>10-YARD FIGHT<br></strong>Arcade<br>Played on NES</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://harmonymedia.github.io/projecttopia/media/posts/3/10-Yard-Fight.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/10-Yard-Fight-xs.png 300w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/10-Yard-Fight-sm.png 480w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/10-Yard-Fight-md.png 768w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/10-Yard-Fight-lg.png 1024w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/10-Yard-Fight-xl.png 1360w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/10-Yard-Fight-2xl.png 1600w\"  alt=\"\" width=\"622\" height=\"544\"></figure>\n<p>NES' football game. I did play this a few years ago, and I remember liking it because it took a sport I found to be inscrutable, and boiled it down to its basics. It's a bit simpler in elements than Baseball, but the gameplay is I think a little better?</p>\n<p>It's kinda neat that Famicom shipped with so many multiplayer games, given that it's got two controllers built in. Kinda reminds me of Nintendo's rush to get high-quality multiplayer games out of the gate for Switch.</p>\n<p> </p>\n<p class=\"align-center\"><strong>THUNDER FORCE<br></strong>X1</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://harmonymedia.github.io/projecttopia/media/posts/3/Thunder-Force.PNG\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Thunder-Force-xs.PNG 300w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Thunder-Force-sm.PNG 480w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Thunder-Force-md.PNG 768w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Thunder-Force-lg.PNG 1024w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Thunder-Force-xl.PNG 1360w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Thunder-Force-2xl.PNG 1600w\"  alt=\"\" width=\"648\" height=\"378\"></figure>\n<p>I literally can't find a version of this anywhere. The series is a staple of the 16-bit era, and yet the original game was only ever released on a few old PC systems, and was never ported forward.</p>\n<p>That's fine, tho, cause I found some footage, and the game looks rough. Well, it looks primitive. It's a very very early top-down shooter, and I'm honestly completely fine with skipping it over.</p>\n<p> </p>\n<p class=\"align-center\"><strong>LUNAR JETMAN<br></strong>ZX Spectrum<br>Played on Xbox One</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://harmonymedia.github.io/projecttopia/media/posts/3/Lunar-Jetman-2.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Lunar-Jetman-2-xs.png 300w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Lunar-Jetman-2-sm.png 480w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Lunar-Jetman-2-md.png 768w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Lunar-Jetman-2-lg.png 1024w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Lunar-Jetman-2-xl.png 1360w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Lunar-Jetman-2-2xl.png 1600w\"  alt=\"\" width=\"606\" height=\"484\"></figure>\n<p>This game is upsettingly unfair. It's the sequel to Jetpac, and like that game, features a player character with a jetpack, and alien creatures/debris (?) that travels very fast in diagonal lines.</p>\n<p>In Jetpac, you could kind of strategize because the aliens (and you) can loop around the screen, so you could see things coming and avoid them. Here, you're on a more linear surface, and the flaws in the game's design become clear immediately.</p>\n<p>Your pea-shooter gun has no range, so if something's flying at your face but your gunfire is just a little too low, it'll kill you anyway. The aliens move extremely quickly, and your walking speed is very slow, so there's no way to effectively dodge.</p>\n<p>The game sees you piloting a lunar rover across a planetary surface, and every time there's a pothole you have to get out and patch the hole. But if you are hit by something and die, another pothole gets created, which creates an infinite loop (until you run out of lives).</p>\n<p>Jetpac is a totally decent arcade game. This sequel is just deeply frustrating.</p>\n<p> </p>\n<p class=\"align-center\"><strong>ATIC ATAC<br></strong>ZX Spectrum<br>Played on Xbox One</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://harmonymedia.github.io/projecttopia/media/posts/3/Atic-Atac-2.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Atic-Atac-2-xs.png 300w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Atic-Atac-2-sm.png 480w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Atic-Atac-2-md.png 768w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Atic-Atac-2-lg.png 1024w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Atic-Atac-2-xl.png 1360w ,https://harmonymedia.github.io/projecttopia/media/posts/3/responsive/Atic-Atac-2-2xl.png 1600w\"  alt=\"\" width=\"641\" height=\"483\"></figure>\n<p>Third Rare game for the ZX Spectrum. This is another fascinating little oddity. If it was the only game I owned, or I cared more about it, I'd probably go ahead and keep throwing myself at it until I solved it.</p>\n<p>You play as one of three character types (knight, wizard, serif) in a top-down format as you try to escape from a haunted house. There's monsters, keys, and secret passageways. Aesthetically, it's one of my favorite of the bunch so far.</p>\n<p>I'm reminded of 2D Zelda dungeons, but if I had, like, no map or sense of where I was supposed to go, and also if the dungeon was extremely large. It also reminds me of Binding of Isaac, where your ability to progress early on is pretty random. If I was patient, I could probably map the game out, but the game has a timer and respawning enemies that push you along, so you kinda only get a sense of what's going down in spookytown.</p>\n<p>I like the visual design, which is a weird thing to say for the janky-ass graphics of the Spectrum. I'll definitely come back to it. But this is definitely a bit too obtuse for me to enjoy playing for too long at a time.<br><br><br></p>",
            "author": {
                "name": "Harmony"
            },
            "tags": [
                   "Retro Games"
            ],
            "date_published": "2020-12-05T18:43:50-06:00",
            "date_modified": "2020-12-05T20:35:00-06:00"
        },
        {
            "id": "https://harmonymedia.github.io/projecttopia/what-this-is.html",
            "url": "https://harmonymedia.github.io/projecttopia/what-this-is.html",
            "title": "What This Is and Current Media Projects",
            "summary": "Hi. So. I keep starting these ridiculously long overly-comprehensive media projects. Reading every Marvel comic of the last 20 years, playing thousands of Nintendo games stretching over the entire history of the medium. And I have some thoughts about these things. Quite a lot of&hellip;",
            "content_html": "<p>Hi. So.</p>\n<p>I keep starting these ridiculously long overly-comprehensive media projects. Reading every Marvel comic of the last 20 years, playing thousands of Nintendo games stretching over the entire history of the medium.</p>\n<p>And I have some thoughts about these things. Quite a lot of them, actually.</p>\n<p>This is a place where I'm keeping all of my thoughts. It's a personal journal so reviews won't necessarily have in-depth analysis. B<span style=\"color: var(--text-editor-body-color); font-family: var(--font-base); font-size: inherit; font-weight: var(--font-weight-normal);\">ut hey, if these are interesting to anybody to read, that's pretty cool too.</span></p>\n<p>Here are the media projects I'm currently working on, and what they mean.</p>\n<p><strong>MARVEL COMICS:</strong> The last 20-ish years of Marvel Comics have changed the face of superhero media, and media in general. Also, I just generally love Marvel in general. The Marvel project, currently, is to read just about every issue of Marvel Comics starting around the turn of the millennium.</p>\n<p><strong>SHONEN JUMP:</strong> Midway thru 2020, I decided to catch up with all the currently running series in Weekly Shonen Jump. I'll post my thoughts on the series as I go thru them.</p>\n<p><strong>HISTORY OF VIDEO GAMES:</strong> This one's a bit harder to explain, but basically: I missed most video games growing up, and there's a lot I want to get to. I put together a timeline of video games that starts with every game represented in the Super Smash Bros. series (which includes a lot of the classics in some way), and then expanded with a few other collections and oeuvres, like recent Bethesda and Eidos Interactive games, plus Rare Replay, recent mini consoles, etc. Thru this project, I will play as many of these games as I can. Anything I can't find at all, I'll at least try to track down some footage to get an idea.</p>\n<p>I hope you all enjoy!</p>",
            "author": {
                "name": "Harmony"
            },
            "tags": [
                   "Shonen Jump",
                   "Retro Games",
                   "Marvel Comics"
            ],
            "date_published": "2020-12-03T18:20:55-06:00",
            "date_modified": "2020-12-05T20:43:34-06:00"
        }
    ]
}
